{
  "backend/main.mo": "Motoko canister implementing user profiles, task creation/completion with rewards, balances, and withdrawal requests with access control.",
  "feature_evidence.json": "Feature-to-file mapping report documenting implemented app features, related components, and confidence levels.",
  "frontend-file-summaries.txt": "Reference list of high‑level summaries for major frontend source files.",
  "frontend/index.css": "Defines global Tailwind layers and banana‑themed OKLCH design tokens for light and dark modes.",
  "frontend/index.html": "Base HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React app managing auth state, profile setup, navigation, and page rendering.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth and query cache resets.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for new users to set their display name and save their profile.",
  "frontend/src/components/feedback/ErrorBanner.tsx": "Reusable alert banner for showing error messages with optional dismissal.",
  "frontend/src/components/layout/AppLayout.tsx": "Shared app layout with optional top navigation and a branded footer.",
  "frontend/src/components/marketing/SignedOutHero.tsx": "Marketing hero section for unauthenticated users with branding, features, and login CTA.",
  "frontend/src/components/nav/TopNav.tsx": "Top navigation bar that shows logo, user info, and navigation buttons based on authentication.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing login, stored identity, and status states.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend interactions such as profiles, balance, tasks, and withdrawals.",
  "frontend/src/index.css": "Tailwind base styles with banana‑themed light/dark design tokens and global styles.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, and InternetIdentityProvider.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page showing balance, task stats, and recent activity using user profile data.",
  "frontend/src/pages/EarnPage.tsx": "Earn page listing tasks with completion actions, loading states, and error handling.",
  "frontend/src/pages/WithdrawPage.tsx": "Implements the withdrawal request page, handling amount validation, submitting withdrawal mutations, and listing the user’s past requests.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, components, animations, and plugins for the app’s visual styling.",
  "project_state.json": "Tracks the project’s state, features, requirements, and asset needs for the Banana Earn app."
}