{
  "kind": "build_request",
  "title": "Create a basic earning (rewards) app with tasks, balance, and withdrawal requests",
  "projectName": "Banana Earn",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement Internet Identity login and show a signed-in vs signed-out experience for the earning app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "💰 Earning app banana hai?"
        ]
      },
      "acceptanceCriteria": [
        "When signed out, the app shows a clear call-to-action to sign in with Internet Identity.",
        "When signed in, the app shows the user’s identity (or a shortened principal) and a logout button.",
        "No read-only (immutable) hook files are modified; authentication is integrated using the existing Internet Identity hooks."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Create backend data models and APIs to support an earning (rewards) flow: user profile, balance, task completion records, and withdrawal requests.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "💰 Earning app banana hai?"
        ]
      },
      "acceptanceCriteria": [
        "Backend persists per-user balance and history in stable storage within the single Motoko actor.",
        "Backend exposes query/update methods to: fetch user dashboard data (balance + recent activity), list available tasks, submit task completion, and create/list withdrawal requests.",
        "Duplicate task completion is prevented (a user cannot complete the same task more than once unless the task is explicitly repeatable)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Build the main earning app UI with pages/sections for: Dashboard (balance + recent activity), Earn (task list), and Withdraw (request payout + request status list).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "💰 Earning app banana hai?"
        ]
      },
      "acceptanceCriteria": [
        "Dashboard displays current balance and a list of recent earning/withdrawal events.",
        "Earn section displays tasks with reward amounts and a button to complete/claim, reflecting completion state after action.",
        "Withdraw section allows entering an amount (validated against available balance) and submitting a withdrawal request, then shows the request in a list with status (e.g., Pending/Approved/Rejected)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add basic anti-abuse and validation rules to keep the earning app consistent and safe: positive rewards, balance never goes negative, and withdrawal amount checks.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "💰 Earning app banana hai?"
        ]
      },
      "acceptanceCriteria": [
        "Backend rejects withdrawals larger than the user’s available balance and rejects non-positive amounts.",
        "Backend guarantees balance cannot become negative even under repeated calls.",
        "Frontend shows user-friendly English validation messages for invalid amounts and failed actions."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Seed the app with a small set of example earning tasks (stored/defined in the backend) so the UI is usable immediately after deployment.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "💰 Earning app banana hai?"
        ]
      },
      "acceptanceCriteria": [
        "At least 5 example tasks are available (e.g., daily check-in, profile completion, tutorial read, etc.), each with a title, description, reward amount, and repeatability flag.",
        "Tasks can be listed without any manual setup steps after deployment."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Apply a cohesive, creative visual theme (colors, typography, layout) suitable for a “Banana Earn” rewards app and use it consistently across all screens.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "💰 Earning app banana hai?"
        ]
      },
      "acceptanceCriteria": [
        "The app uses a consistent design system across Dashboard/Earn/Withdraw (spacing, type scale, button styles, cards).",
        "Theme avoids a blue/purple default palette and instead uses a distinctive non-blue/purple palette appropriate for the app.",
        "All user-facing UI text is in English."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Generate and include static visual assets for the app (logo + simple header/hero illustration) and render them from frontend static assets.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "💰 Earning app banana hai?"
        ]
      },
      "acceptanceCriteria": [
        "Generated images are placed under frontend/public/assets/generated and referenced directly by the frontend.",
        "App displays the generated logo in the top navigation/header.",
        "App displays the generated header/hero illustration on the signed-out landing and/or dashboard header."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo (no multi-canister backend architecture).",
    "Do not modify files under frontend/src/components/ui or other frontend immutablePaths; compose those components instead.",
    "Use only Internet Identity for authentication (no third-party auth providers).",
    "User-facing text must be in English."
  ],
  "nonGoals": [
    "Integrating real-money payouts or payment processors (e.g., Stripe, bank transfers, crypto wallets).",
    "Integrating third-party offerwalls, ad networks, survey providers, or external databases/services.",
    "Real-time updates via WebSockets or push notifications."
  ],
  "imageRequirements": {
    "required": [
      "Banana-themed app logo, flat vector style, high contrast (banana-earn-logo.dim_512x512.png)",
      "Minimal header/hero illustration with bananas and coins, clean modern style (banana-earn-hero.dim_1600x600.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}